Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །འཁོར་དེར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་ཞེས་བྱ་བ་ཆོས་མཉན་པའི་ཕྱིར་འདུས་པར་གྱུར་ཏེ་འདུག་གོ།
en: A bodhisattva great being named Ākāśagarbha was present in that assembly in order to listen to the Dharma.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོས་སྟེང་གི་ནམ་མཁའ་ལ་བལྟས་སོ། །དེས་ཀྱང་དེར་ནམ་མཁའ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བྱང་ཕྱོགས་ཀྱི་ཕྱོགས་ཆ་ནས་ལྷོ་ཕྱོགས་སུ་འདོང་བ་དག་མཐོང་བར་གྱུར་ཏོ།
en: At one point, he looked in the sky above and saw an innumerable and limitless number of bodhisattva great beings departing from the north and proceeding toward the south.

source: །དེས་ལྷོ་ཕྱོགས་སུ་རྣམ་པར་བལྟས་ཏེ་སྣང་བ་ཆེན་པོ་མཐོང་ནས་དེས་དེ་བཞིན་གཤེགས་པ་དཔལ་མེ་ཏོག་གི་སྙིང་པོ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་རབ་ཏུ་བཏུད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཏིང་ངེ་འཛིན་གྱི་རྣལ་འབྱོར་ལས་ལངས་ནས་རིང་པོར་མ་ལགས་ཏེ། བདག་གིས་ནི་སྟེང་གི་ནམ་མཁའ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མ་མཆིས། དཔག་ཏུ་མ་མཆིས་པ་བྱང་ཕྱོགས་ཀྱི་ཕྱོགས་ཆ་ནས་ལྷོ་ཕྱོགས་སུ་མཆི་བ་དག་མཐོང་ལགས་སོ།
en: When he looked in the southern direction, he saw a brilliant light. He then bowed down with his palms joined together in the direction of the Buddha Glorious Essence of Flowers and said, “Respected Blessed One, when I recently arose from the practice of absorption, I saw in the sky above an innumerable and limitless number of bodhisattva great beings departing from the north and going toward the south.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་ལྷོ་ཕྱོགས་སུ་རྣམ་པར་བལྟས་ཏེ་སྣང་བ་ཆེན་པོ་མཐོང་ནས་བདག་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་ལ་རྒྱུ་ནི་གང་ལགས་སྙམ་ལགས་སོ།
en: Then, respected Blessed One, as I looked toward the south, I saw a brilliant light and wondered, ‘Why is this so?’ ”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དཔལ་མེ་ཏོག་གི་སྙིང་པོ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ལྷོ་ཕྱོགས་ཀྱི་ཕྱོགས་ཆ་ན་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བརྒྱད་ཅུའི་བྱེ་མ་སྙེད་འདས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དོ། །འདི་ལྟར་སྙིགས་མ་ལྔ་དང་ལྡན་པར་གནས་པ་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ།
en: The thus-gone Glorious Essence of Flowers replied to the bodhisattva great being Ākāśagarbha, “Noble son, in the southern direction, beyond buddha realms as numerous as the grains of sand in eighty Ganges Rivers, there is a buddha realm ripe with the five degenerations called Sahā, where the thus-gone, worthy, perfect Buddha Śākyamuni resides.

source: འཚོ་ཞིང་གཞེས་ལ་འདུས་པ་ཆེན་པོ་ལ་ཆོས་ཀྱི་ཚུལ་ཡུན་རིང་དུ་གནས་པར་བྱ་བའི་ཕྱིར་དང་། དཀོན་མཆོག་གསུམ་གྱི་གདུང་གི་ཆོས་ཀྱིས་གནས་པ་རྒྱུན་མི་གཅད་པར་བྱ་བའི་ཕྱིར་ད་ལྟར་ཐེག་པ་གསུམ་གྱི་རྣམ་པར་གཏན་ལ་དབབ་པ་བསྟན་པའི་སྒོའི་ཆོས་ཀྱི་རྣམ་གྲངས་རབ་ཏུ་སྟོན་ཏོ།
en: He thrives, lives well, and to a great assembly he now reveals Dharma teachings that are the gateways to the ascertainment of the three vehicles, to ensure that the Dharma way endures for a long time and that those who abide by the Dharma of the lineage of the Three Jewels remain without interruption.

source: །སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེར་བདུད་ཀྱི་ཡུལ་རྣམ་པར་གཞིག་པ་དང་། དྲི་མ་མེད་པར་མཛད་པའི་ཕྱིར་དང་། ཆོས་ཀྱི་རྒྱལ་མཚན་བསྒྲེང་བར་མཛད་པའི་ཕྱིར་དང་། ཆོས་ཀྱི་ཚུལ་ཡུན་རིང་དུ་གཞག་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་འདུས་པ་ཆེན་པོ་བྱུང་བར་གྱུར་ཏོ།
en: In that buddha realm of Sahā, a great assembly of the Buddha has gathered to destroy and cleanse the domain of the māras, to raise the banner of the Dharma, and to ensure that the Dharma way remains for a long time.

source: །དེར་ཡང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་རིན་པོ་ཆེའི་ཏོག་གི་གཟུངས་སྔགས་གསུངས་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་སྤྱད་ནས་གཤེགས་སོ།
en: There, all the thus-gone ones have uttered the dhāraṇī mantra called jewel crest and then left after having engaged with that buddha realm.

source: །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱི་འདུས་པ་ཆེན་པོ་ཡང་དག་པར་སྒྲུབ་པར་མཛད་དེ། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་ཡང་དག་པར་ལྡན་པ་མིག་གསུམ་པའི་ཚངས་པའི་གནས་པ་བསྟན་ཀྱང་དེ་ན་ད་དུང་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ས་དང་ནམ་མཁའ་གང་བ་ཞིག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་མཆོག་ཏུ་སྙན་པར་གསུང་བའི་ཆོས་བསྟན་པས་ཚིམ་པར་མ་གྱུར་ཏོ།
en: The thus-gone Śākyamuni has gathered a great assembly of bodhisattva great beings and great hearers who possess the three eyes that are endowed with the four correct knowledges and who display the sublime states.

source: །མཆོག་ཏུ་སྙན་པ་གསུང་བ་ཤཱཀྱ་ཐུབ་པ་དེ་ཡང་བསྡུ་བའི་དངོས་པོ་བཞི་དང་། ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུའི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཟད་པར་བྱེད་པའི་གཟུངས་སྔགས་བཤད་པར་བཞེད་དོ། །
en: This retinue fills the earth and the sky of that buddha realm of Sahā, and it is insatiable with respect to the Dharma teachings of the thus-gone Śākyamuni, who is endowed with the most delightful voice.

source: དེ་བཞིན་གཤེགས་པ་དེ་འདི་སྙམ་དུ་དགོངས་ཏེ། ཕྱོགས་བཅུ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་སུ་དག་བསྐལ་པ་བརྒྱས་ངེས་པར་འབྱུང་བ་ཞེས་བྱ་བ་ནས་གང་དག་སྲིད་པ་ཐ་མ་པ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པ་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་ལ་མཁས་པ་དག་འདིའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་འཇུག་པར་གྱུར་ཅིག །འདིར་འཁོད་ནས་ཀྱང་རང་རང་གི་དགེ་བའི་ཕྱོགས་ཀྱི་བསམ་གཏན་དག་གིས་གནས་པར་གྱུར་ཅིག །
en: “Wishing to explain the four means of attracting disciples, the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the domain of the nāgas, the dhāraṇī mantra that exhausts the karmic actions of sentient beings, that thus-gone Śākyamuni, who is endowed with the most delightful voice, has formed the wish,

source: འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་ས་ཆེན་པོ་ལྷག་པར་མཐུ་དང་ལྡན་པ་དང་། བཅུད་དང་ལྡན་པ་དང་། ཡོན་ཏན་དང་ལྡན་པ་དག་ཏུ་གྱུར་ཅིག །འདི་ལྟར་འདིར་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་བཞིན་དུ་ཐམས་ཅད་དྲན་པ་དང་ལྡན་པ་དག་དང་། བརྩོན་འགྲུས་དང་ལྡན་པ་དག་དང་། གཏོང་བ་དང་ལྡན་པ་དག་དང་། ཤེས་རབ་དང་ལྡན་པ་དག་ཏུ་གྱུར་ཅིག །
en: ‘May the bodhisattva great beings from the buddha realms of the ten directions—from those who will reach emancipation over a hundred eons up to those who are in their final existence and possess the eighteen unique qualities, who are not led astray by others, and who are experts in unobstructed wisdom—enter this buddha realm of Sahā at this very moment!

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་སུ་དག་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ནས་ཡང་དག་པར་ཞུགས་པ་དེ་དག་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིའི་ནང་དུ་ཆུད་པར་གྱུར་ཅིག །དེ་ཉིད་དུ་འཁོད་ནས་ཀྱང་རང་རང་གི་དགེ་བའི་ཕྱོགས་ལ་སྟོབས་ཇི་ལྟ་བ་དང་། ཇི་ལྟར་འཚམ་པ་བཞིན་དུ་འཁོད་ནས་བསམ་གཏན་བྱེད་པར་གྱུར་ཅིག་སྙམ་དགོངས་སོ།
en: Once they are here, may they abide by each of their virtuous concentrations! In the same way, may the great earth in this buddha realm come to possess great strength, nourishment, and qualities. In the same way, may everyone be endowed with recollection, diligence, generosity, and insight—just as in other buddha realms! May all bodhisattva great beings who are dwelling in the buddha realms of the ten directions enter this buddha realm of Sahā at this very moment! Once they have gathered here, may they dwell in accordance with the power of their individual virtues and in accordance with their concentrations!’

source: །བསམ་གཏན་བྱེད་པ་དེ་དག་ཁ་ཅིག་གི་ལུས་ལས་འོད་འདི་ལྟ་བུ། དཔེར་ན་འབྲུ་མར་གྱི་མར་མེ་ལྟ་བུ་བྱུང་ངོ་ཞེས་བྱ་བ་ནས་ཁ་ཅིག་གི་ལུས་ལས་འོད་འདི་ལྟ་བུ།
en: “The light that radiates from the bodies of some of those beings who are absorbed in states of concentration is like the light emitted by oil lamps.

source: དཔེར་ན་ཟླ་བ་དང་ཉི་མ་བྱེ་བ་ཕྲག་བརྒྱ་སྟོང་མང་པོའི་འོད་ལྟ་བུ་བྱུང་ངོ་ཞེས་བྱ་བའི་བར་དུ་སྦྱར་རོ།
en: The light that radiates from the bodies of some is like the light emitted by [. . .] many trillions of suns and moons.

source: །དེ་ན་ད་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འདུས་པས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེ་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ།
en: This brilliant light emitted by the gathering of those bodhisattva great beings is now pervading the buddha realm of Sahā.

source: །ད་ལྟར་གང་དག་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་སྙོམས་པར་ཞུགས་པར་གྱུར་ལ། སྔོན་ཆད་དེར་ཕྱིན་པ་ནི་མ་ཡིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི་དེ་ལྟར་ཏིང་ངེ་འཛིན་ལས་ལངས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེར་ཆས་སོ།
en: Right now, the bodhisattva great beings who had withdrawn into meditative seclusion in all the buddha realms of the ten directions and who had never previously gone to the buddha realm of Sahā have arisen from their absorptions and departed for that realm.

source: །དེར་ཕྱིན་ནས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་བར་འགྱུར་རོ། །འདུས་པ་ཆེན་པོ་དེ་ཡང་མཐོང་བར་འགྱུར་རོ།
en: Once they arrive there, they will behold that thus-gone one and his great assembly.

source: །གཟུངས་སྔགས་ཆེན་པོ་དེ་ཡང་ཐོས་པར་འགྱུར་རོ། །སྐྱིལ་མོ་ཀྲུང་དུ་འདུག་ནས་རང་རང་གི་དགེ་བའི་ཕྱོགས་ཀྱི་བསམ་གཏན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་རྩེ་བར་འགྱུར་རོ།
en: They will hear that great dhāraṇī mantra, sit cross-legged, and revel in a variety of individual virtuous concentrations.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱང་ད་ལྟར་ཏིང་ངེ་འཛིན་ལས་ལངས་ཀྱིས་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེར་འགྲོ་བར་བྱའོ།
en: “Noble son, you should also arise from your absorption and go to the buddha realm of Sahā!

source: །རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེ་ན་ཡང་སེམས་ཅན་དག་མཆོག་ཏུ་ཚེ་ཐུང་བ་དག་ཡིན།
en: Noble son, in that buddha realm of Sahā, sentient beings have extremely short lifespans.

source: ནད་མང་བ་དག་ཡིན། བློ་ཆུང་བ་དག་ཡིན། དགེ་བའི་རྩ་བ་ཀུན་ཏུ་སྤྱོད་པ་ཆུང་བ་དག་ཡིན།
en: They are affected by many diseases, their intelligence is weak, and their involvement with roots of virtue is limited.

source: བསོད་ནམས་ཆུང་བ་དག་ཡིན། དགེ་བའི་རྩ་བའི་བྱ་བ་ཚོལ་བ་ཆུང་བ་དག་ཡིན། འཇིག་རྟེན་ཕ་རོལ་ལ་འཇིགས་པར་མི་ལྟ་བ་དག་ཡིན། ལོངས་སྤྱོད་དང་ཉེ་བར་སྤྱོད་པ་ཆུང་བ་དག་ཡིན། འདོད་པ་ལ་ཆུམས་པ་དག་ཡིན།
en: Their merit and their pursuit of virtuous activities are weak, they are not afraid of the afterlife, their resources and possessions are few, and they are attached to desirable objects.

source: མི་དགེ་བ་སྤྱོད་པ་དག་ཡིན། ཕྲག་དོག་དང་ལྡན་པ་དག་ཡིན། ངོ་ཚ་ཤེས་པ་དང་ཁྲེལ་ཡོད་པ་དག་སྤངས་པ་ཡིན་ཏེ།
en: They engage in nonvirtue, they are envious, and they have abandoned modesty and humility.

source: དེ་དག་ཕལ་ཆེར་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་པས་ངན་སོང་དུ་འགྲོ་བ་དག་ཡིན་ནོ།
en: Since most of them have adopted the paths of the ten nonvirtuous actions, they will be born in the lower realms.

source: དེ་ན་གང་དག་འདྲེན་མར་སྤྱོད་པའི་སེམས་ཅན་ཡོད་པ་དེ་དག་འཆི་བའི་དུས་བྱས་ནས་དེ་ཉིད་དུ་སྡིག་པ་བྱེད་པའི་གནོད་སྦྱིན་ཞེས་བྱ་བ་ནས། སྡིག་པ་བྱེད་པའི་ལུས་སྲུལ་པོ་ཞེས་བྱ་བའི་བར་དག་ཏུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: Because, after they die, sentient beings living there who engage in a variety of actions are born in that same place as evil beings—from yakṣas to kaṭapūtanas.

source: སྡིག་པ་བྱེད་པའི་གནོད་སྦྱིན་ཞེས་བྱ་བ་ནས། ལུས་སྲུལ་པོ་ཞེས་བྱ་བའི་བར་དེ་དག་ཀྱང་དེར་སའི་བཅུད་ཀྱི་མདངས་ཕྲོགས་ནས་ཡོངས་སུ་སྤྱོད་པར་བྱེད་དོ།
en: Those evil beings—from yakṣas to kaṭapūtanas—feed themselves by robbing the earth of its vitality.

source: །འབྲུ་དང་། སྨན་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། འདབ་མ་དང་། རོ་རྣམས་ཀྱི་མདངས་ཕྲོགས་ནས་ཀྱང་ཡོངས་སུ་སྤྱོད་པར་བྱེད་དོ།
en: They also feed themselves by robbing of their vitality all grains, herbs, flowers, fruits, leaves, and juices.

source: །དེས་ན་སྟོབས་དང་ལྡན་པ་དག་ཡིན་ནོ།
en: In this sense they are powerful beings.

source: །དེར་དེ་དག་མངལ་ན་གནས་པའི་མི་རྣམས་ཀྱི་མདངས་དག་འཕྲོག་པར་བྱེད་དོ། །མི་རྣམས་སྐྱེས་པ་ཙམ་གྱི་མོད་དག་ལ་མྱུར་དུ་མདངས་འཕྲོག་པར་བྱེད་དོ།
en: They also rob the vitality of humans who are in the womb and the vitality of those who have just been born.

source: །འོ་མའི་མདངས་དག་ཀྱང་འཕྲོག་པར་བྱེད་དོ། །བཟའ་བ་དང་བཏུང་བའི་མདངས་དག་ཀྱང་འཕྲོག་པར་བྱེད་དོ།
en: They also rob the vitality of the milk and the vitality of food and beverages.

source: །དེར་དེ་དག་གིས་མི་མངལ་དུ་ཞུགས་པའི་མདངས་ཕྲོགས་ཤིང་སྐྱེས་པ་ཙམ་གྱིས་མོད་ལ་མདངས་ཕྲོགས་པས་དེ་དག་ཀྱང་མདངས་ལ་མི་རེག་ཅིང་བཟའ་བ་དང་བཏུང་བ་ཉམས་པ་ཡོངས་སུ་སྤྱད་ཟིན་པ་ལ་ཡོངས་སུ་སྤྱོད་པར་བྱེད་དེ།
en: Since, in that place, they rob the vitality of humans when they are in the womb and right after they are born, the humans lack vitality and so must feed themselves on food and drink that are already degraded.

source: རྒྱུ་དེས་དེ་ན་མི་རྣམས་མཆོག་ཏུ་ན་བ་དག་དང་། ཚེ་ཐུང་བ་དག་དང་། དྲན་པ་ཉམས་པ་དག་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཉམས་པ་དག་དང་། བསོད་ནམས་དང་བྲལ་བ་དག་དང་། འཇིག་རྟེན་ཕ་རོལ་ལ་འཇིགས་པར་མི་ལྟ་བ་དག་དང་། ལོངས་སྤྱོད་དང་ཉེ་བར་སྤྱོད་པ་དང་བྲལ་བ་དག་དང་། འདོད་པ་ལ་ཆུམས་པ་དག་དང་། ཀུན་སྤྱོད་པ་མི་གཙང་བ་དག་ཡིན་ཞེས་བྱ་བ་ནས་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་པས་ངན་སོང་དུ་འགྲོ་བ་དག་ཡིན་ནོ་ཞེས་བྱ་བའི་བར་ཡིན་ནོ།
en: Because of this, the humans living there are very sickly and have short lifespans. They are forgetful, and all their roots of virtue are corrupted. They are devoid of merit, they are not afraid of the afterlife, they lack resources and possessions, and they are attached to desirable objects. Since their conduct is impure, [. . .] and since they have adopted the paths of the ten nonvirtuous actions, they will be born in the lower realms.

source: །རིགས་ཀྱི་བུ་སྔོན་ང་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པའི་སྨོན་ལམ་འདི་ལྟ་བུར་གྱུར་ཏེ། འདི་ལྟར་ང་བྱ་བ་ལ་བརྩོན་པ་དང་། སྤྲོ་བ་དང་། བརྟུལ་བ་བརྟེན་པར་གྱུར་ཏོ། །སྔོན་གྱི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་དག་བཞུགས་པར་ངས་བསྙེན་བཀུར་བྱས་སོ།
en: “Noble son, in the past, when I was a bodhisattva, I made the aspiration to be endowed with diligence, enthusiasm, and firm resolution during my activities, and I venerated the perfect buddhas of the past.

source: །ངས་ཐབས་གང་གིས་བུད་མེད་སྦྲུམ་པ་བསྲུང་བར་ནུས་པ་ཡང་ཡོངས་སུ་ཞུས་སོ།
en: I supplicated them so that I may be able to protect pregnant women by whatever means necessary.

source: །ངའི་བརྩོན་འགྲུས་གང་གིས་མ་བདེ་ལེགས་སུ་འགྱུར་བ་དང་། མངལ་ན་ཡོད་པ་བདེ་ལེགས་སུ་འགྱུར་བ་ཡོངས་སུ་ཞུས་སོ། །
en: I supplicated them so that, through my diligence, both the mothers and the children present in their wombs may experience well-being.

source: ལྷའམ། ཀླུའམ། གནོད་སྦྱིན་ནམ། སྲིན་པོའམ། ནམ་མཁའ་ལྡིང་ངམ། མི་འམ་ཅིའམ། ལྟོ་འཕྱེ་ཆེན་པོའམ། གྲུལ་བུམ་མམ། ཡི་དགས་སམ། ཤ་ཟའམ། སྲུལ་པོའམ། ལུས་སྲུལ་པོའམ། མདངས་འཕྲོག་པའམ། བརྗེད་བྱེད་དམ། རིམས་ཉིན་གཅིག་པའམ། ཉིན་གཉིས་པའམ། ཉིན་གསུམ་པའམ། ཉིན་བཞི་པའམ། རོ་ལངས་གང་ཡང་དུག་གམ། སྔགས་ཀྱི་སྦྱོར་བའམ། སྨན་གྱི་སྦྱོར་བས་ལུས་དང་། སེམས་ལ་གནོད་པ་བྱ་བར་མི་ནུས་པ་ཡོངས་སུ་ཞུས་སོ།
en: I supplicated them so that no gods, nāgas, yakṣas, rākṣasas, garuḍas, kinnaras, mahoragas, kumbhāṇḍas, pretas, piśācas, pūtanas, kaṭapūtanas, ojohāras, apasmāras, fevers that last one day, fevers that last two days, fevers that last three days, fevers that last four days, vetālas, mantras, or medicines may be able to harm their bodies and minds.

source: །གང་གིས་ཀྱང་མའམ། མངལ་ན་ཡོད་པ་དང་། སྐྱེས་མ་ཐག་པ་དང་། འོ་མ་འཐུང་བ་དང་། བཟའ་བ་དང་། བཏུང་བ་ཡོངས་སུ་སྤྱོད་པ་ལ་གནོད་པར་བྱ་བར་མི་ནུས་པར་ཡོངས་སུ་ཞུས་སོ། །
en: I supplicated them so that the mothers, the children present in their wombs, the newborn children, the milk they drink, and the food and drink they ingest may not be harmed in any way.

source: གང་གིས་ཀྱང་མདངས་འཕྲོག་པའམ། ལུས་དཀྲུག་པའམ། ཁམས་དཀྲུག་པའམ། སེམས་དཀྲུག་པར་བྱ་བར་མི་ནུས་པར་ཡོངས་སུ་ཞུས་སོ།
en: I supplicated them so that their vitality may not be robbed and so that their bodies, elements, and minds may not be disturbed in any way.

source: །གང་གི་ཕྱིར་སེམས་ཅན་དེ་དག་ཐ་མལ་པར་མངལ་ན་གནས་པར་ཡོངས་སུ་ཞུས་སོ། །ལུས་དང་སེམས་ལ་རྣམ་པར་ཐོ་མ་བཙམས་པས་བདེ་བར་མའི་མངལ་ནས་གནོད་པ་མེད་པར་འབྱུང་བ་ཡོངས་སུ་ཞུས་སོ།
en: I supplicated them so that those beings may remain in the womb in a natural way and so that they may come out of the womb easily and unharmed, without their bodies or minds being hurt.

source: །བདེ་བར་འོ་མ་འཐུང་བ་ཡོངས་སུ་ཞུས་སོ། །བདེ་བར་བཟའ་བ་དང་བཏུང་བ་ཡོངས་སུ་སྤྱད་པ་ཡོངས་སུ་ཞུས་སོ།
en: I supplicated them so that they may drink milk and enjoy food and beverages with ease.

source: །གནོད་པ་ཆུང་བ་དང་། ཚེ་རིང་བ་དང་། བློ་དང་ལྡན་པ་ཞེས་བྱ་བ་ནས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་པའི་བར་དང་། སྦྱིན་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་ལ་མངོན་པར་དགའ་བ་དང་། འཇིག་རྟེན་ཕ་རོལ་ལ་འཇིགས་པར་ལྟ་བ་ཡིན་པ་དག་ཀྱང་ཡོངས་སུ་ཞུས་སོ།
en: I supplicated them so that they may experience little discomfort, live a long life, be intelligent, [. . .] adopt the paths of the ten virtuous actions, delight in generosity, self-control, and restraint, and be afraid of the afterlife.

source: །ངས་གསང་སྔགས་གང་དག་དང་། སྨན་གང་དག་གིས་སེམས་ཅན་དེ་ལྟ་བུ་དག་ཡོངས་སུ་སྨིན་པར་མཛད་པར་སྤྱོད་པའི་གསང་སྔགས་དེ་དག་ནི་གང་ཡིན། སྨན་དེ་དག་ནི་གང་ཡིན་ཞེ་ན། གཟུངས་སྔགས་གང་གིས་ངས་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་སྨིན་པར་མཛད་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བཀོད་པ་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་གསང་སྔགས་ཀྱི་གཞིའི་གཟུངས་སྔགས་ལུང་བསྟན་པ་ཆེན་པོ་འདི་སྔོན་གྱི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས་ཀྱང་ང་ལ་བསྟན་པར་གྱུར་ཏོ།
en: I asked them what are the mantras and medicines through which I could ripen those sentient beings, and so those perfect buddhas of the past taught me this great teaching—a mantra formula, a dhāraṇī mantra called the peaceful core of knowledge, through which I could ripen infinite myriads of beings and establish them in the six perfections.

source: །རྟག་ཏུ་བརྩོན་འགྲུས་དང་། བརྟུལ་བ་བརྟན་པ་ངས་རྟག་པར་རྒྱུན་དུ་ཚེ་རབས་དེ་དང་དེ་དག་ཏུ་མངལ་ན་བུ་ཡོད་པའི་བུད་མེད་ལ་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་གཟུངས་སྔགས་གསང་སྔགས་ཀྱི་གཞི་རིག་སྔགས་འདིས་བསྲུང་བ་བྱས་སོ།
en: “With firm diligence and resolution, in all my lives I continuously protected pregnant women with this dhāraṇī mantra, this mantra formula, this vidyā mantra called the peaceful core of knowledge.

source: །བུད་མེད་དེ་མངལ་ན་བུ་ཡོད་པ་དང་བཅས་ཏེ་སྐྱབས་གསུམ་ལ་རྣམ་པར་གཞག་གོ། །
en: I established in the three objects of refuge these women and the children in their wombs.

source: ཕྱིན་ཆད་ཀྱང་ལྷའམ་ཞེས་བྱ་བ་ནས། བདུད་དམ། བརྗེད་བྱེད་དམ། མི་དང་། མི་མ་ཡིན་པ་ཞེས་བྱ་བའི་བར་གྱིས་མའི་མངལ་ན་བུ་ཡོད་པ་དང་བཅས་ཏེ་རྣམ་པར་ཐོ་བཙམས་པའམ། རྣམ་པར་གཙེ་བའམ། ལུས་དཀྲུག་པའམ། ཁམས་དཀྲུག་པའམ། སེམས་དཀྲུག་པར་བྱ་བར་མི་ནུས་སོ།
en: From then on, those pregnant women and their children could not be hurt or injured, and their bodies, elements, and minds could no longer be disturbed by gods or any other beings, including māras, apasmāras, humans, and nonhumans.

source: །ལྷ་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་བར་གྱིས་ཀྱང་མདངས་འཕྲོག་པའམ། སྨན་དང་སྔགས་ཀྱི་སྦྱོར་བ་བྱ་བར་མི་ནུས་སོ།
en: The world with its gods and asuras could no longer rob their vitality or hurt them with any medicines or mantras.

source: །དེ་དག་གིས་མངལ་ན་བུ་ཡོད་པའི་མ་རྣམ་པར་ཐོ་མ་བཙམས་པ་དང་། མངལ་ན་བུ་གནས་པ་ཡང་སྔོན་གྱི་ཚེ་རབས་དྲན་པར་འགྱུར་རོ།
en: Pregnant mothers would not be harmed by them anymore, and the children present in their wombs would remember their previous lives.

source: །ཉིང་མཚམས་སྦྱོར་བའི་ལུས་ཀྱི་དབང་པོ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་དང་། གཟུགས་བཟང་བ། བལྟ་ན་སྡུག་པ།
en: The bodies of those beings who had entered the womb would have perfectly developed faculties, beautiful and elegant appearances, and excellent complexions which are replete with the most delightful features.

source: ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ་དག་དང་། ཤིན་ཏུ་བློ་དང་ལྡན་པ་དག་བདེ་ལེགས་སུ་མའི་ལྟོ་ནས་བྱུང་ཞིང་བརྗེད་ངས་པ་མེད་པའི་སེམས་དང་ལྡན་པ་དག་ཏུ་གྱུར་ཏོ།
en: They would be highly intelligent and emerge from the bellies of their mothers with ease and with minds free of forgetfulness.

source: །དེ་དག་སྐྱེས་པ་ཙམ་གྱི་མོད་ལ་ཡང་ལྷ་སྟོབས་དང་ལྡན་པ་དབང་ཆེ་བར་གྲགས་པ་རེ་རེ་ལ་ཡང་འཁོར་བརྒྱ་སྟོང་ཡོད་པ་དག་བསྲུང་བ་དང་། རྗེས་སུ་སྦ་བར་བྱེད་པར་ཀུན་ཏུ་གནས་སོ། །
en: Immediately after their births, powerful gods renowned for their great strength, each surrounded by a retinue of a hundred thousand members, would protect them and guard them.

source: དེ་དག་མི་དང་མི་མ་ཡིན་པ་ཞེས་བྱ་བའི་བར་གང་གིས་ཀྱང་རྣམ་པར་ཐོ་བཙམ་པའམ། རྣམ་པར་གཙེ་བའམ། ལུས་དཀྲུག་པའམ། ཁམས་དཀྲུག་པའམ། སེམས་དཀྲུག་པར་བྱ་བར་མི་ནུས་སོ། །མདངས་བླང་བར་ཡང་མི་ནུས་སོ། །གསང་སྔགས་དང་། སྨན་གྱིས་ཀྱང་རྣམ་པར་ཐོ་བཙམ་པར་མི་ནུས་སོ།
en: No humans or nonhumans could hurt them, injure them, disturb their bodies, elements, and minds, take their vitality, or hurt them with mantras and drugs.

source: །གང་གི་ཕྱིར་སེམས་ཅན་དེ་དག་མཆོག་ཏུ་གཟུགས་དང་ལྡན་པ་དང་། ཚེ་རབས་དྲན་པ་དང་། འཇིག་རྟེན་ཕ་རོལ་ལ་འཇིགས་པར་ལྟ་བ་དང་། བྱམས་པའི་སེམས་དང་ལྡན་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དང་། གཏོང་བ་དང་ལྡན་པ་དང་། ཚུལ་ཁྲིམས་ལ་རྗེས་སུ་དགའ་བ་དང་། བཟོད་པ་དང་། ཡོན་ཏན་དང་ལྡན་པ་དང་། བརྩོན་འགྲུས་དང་ལྡན་པ་དང་། དབེན་པ་ལ་དགའ་ཞིང་བསམ་གཏན་ལ་མངོན་པར་བརྩོན་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་མངོན་པར་དགའ་བ་དག་དང་། དེ་ཐོབ་པར་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་འགྲོ་བ་འཕགས་པའི་ངེས་པར་འབྱིན་པའི་ཤེས་པ་དང་ལྡན་པ་དག་ཏུ་གྱུར་ཏོ།
en: Those beings would have the most excellent physiques, and they would remember their past lives and be afraid of the afterlife. They would be endowed with a loving mindset, great compassion, and a generous attitude. They would delight in discipline and be endowed with patience, diligence, and other qualities. They would enjoy seclusion, exert themselves in concentration, and experience great joy in the presence of virtuous friends, and they would be endowed with the noble knowledge of emancipation that brings such qualities and leads to the exhaustion of suffering.

source: །སེམས་ཅན་ཉེ་བར་ཞི་བ་ལ་གནས་པ་ཉོན་མོངས་པ་ཆུང་བ་དེ་ལྟ་བུ་དེ་དག་ལ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་རྣམས་ཀྱིས་རིམ་གྲོ་བྱ་བར་བརྩོན་པ་དག་ཡིན་ཏེ།
en: Gods, nāgas, and yakṣas would diligently venerate those beings who dwelled in peace and with few afflictions.

source: མི་དེ་དག་ཀྱང་མཆོག་ཏུ་འཁོར་བ་ལ་སྐྱོན་དུ་བལྟ་བ་དང་། བྱང་གྲོལ་གྱི་བདེ་བ་འདོད་པ་དག་ཏུ་གྱུར་ཏེ།
en: These people would vividly perceive the defects of saṃsāra and wish for the happiness of emancipation.

source: །དེ་དག་གིས་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན་དེ་དག་རིས་འཐུན་པ་དེ་ཉིད་ཀྱིས་མྱུར་དུ་བྱང་ཆུབ་ཀྱི་སེམས་མ་བརྗེད་པར་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་ཏོ།
en: If they were to give rise to the mind set on unsurpassed and perfect awakening, they would accordingly swiftly achieve the absorption of the bodhisattvas without forgetting the mind set on awakening.

source: །ཅི་སྟེ་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་སེམས་བསྐྱེད་ན་དེ་དག་མྱུར་དུ་སྐྱེ་བ་དང་། འཇིག་པ་དང་། རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: If they were to give rise to the mind set on the vehicle of the solitary buddhas, they would swiftly achieve the acceptance that accords with birth and disintegration.

source: །ཅི་སྟེ་སེམས་ཅན་དེ་དག་ཀྱང་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་སེམས་སྐྱེད་པར་བྱེད་ན་སེམས་ཅན་དེ་དག་རིས་འཐུན་པ་ཉིད་ཀྱིས་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཐོབ་པར་བྱེད་དོ།
en: If those sentient beings were to give rise to the mind set on the vehicle of the hearers, they would, in accordance with this, achieve the acceptance that accords with the truth.

source: །སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་ངན་སོང་གསུམ་དང་བྲལ་བ་དང་མཐོ་རིས་སུ་འགྲོ་བ་དག་ཏུ་གྱུར་ཏོ།
en: All those sentient beings would be free from the three lower realms and proceed toward the higher realms.

source: །རིགས་ཀྱི་བུ་ངས་ཐབས་ལ་འཇུག་པའི་སྦྱོར་བ་ལ་བརྟུལ་བ་དེས་སེམས་ཅན་དག་ཡོངས་སུ་སྨིན་པར་བྱས་ཤིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་ཡང་དག་པར་བསྒྲུབས་སོ།
en: Noble son, through my commitment to engaging in the application of such skillful means, I ripened sentient beings and accomplished unsurpassed and perfect awakening.

source: །རིགས་ཀྱི་བུ་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ནི་དེ་ལྟར་དོན་ཆེ་བ་ཡིན་ནོ།
en: Noble son, this great teaching of the peaceful core of knowledge is therefore very meaningful.

source: །རིགས་ཀྱི་བུ་ངས་སེམས་ཅན་ནད་པ་གང་དག་མཐོང་བ་དེ་དག་ལ་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་འདིས་སྨན་སིང་ཧ་ཀྵིར་ལ་བྲམས་ནས་ནད་པ་ལ་བྱིན་ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཏོ།
en: “Noble son, when I saw sentient beings affected by diseases, I would infuse the medicinal plant siṃhakṣir with this great teaching of the peaceful core of knowledge and give it to those sick persons, and all their diseases would be completely cured.

source: །གང་ན་སྨན་སིང་ཧ་ཀྵིར་མེད་པར་ཡང་ངས་དེའི་མདུན་དུ་བཟའ་བ་དང་། བཏུང་བ་གང་ཡིན་པ་ལ་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པས་བྲམས་ནས་ནད་པ་ལ་བྱིན་ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཏོ།
en: Where no such medicinal plant was available, I would instead infuse food and drink with the teaching of the peaceful core of knowledge and give it to those sick persons, and all their diseases would be completely cured.
